[
  {
    "id": 1,
    "jokeText": "What do you call fake spaghetti? An impasta!",
    "jokeType": "Food"
  },
  {
    "id": 2,
    "jokeText": "Why don’t scientists trust atoms? Because they make up everything!",
    "jokeType": "Science"
  },
  {
    "id": 3,
    "jokeText": "Why did the scarecrow win an award? Because he was outstanding in his field!",
    "jokeType": "Occupation"
  },
  {
    "id": 4,
    "jokeText": "What do you get when you cross a snowman and a vampire? Frostbite.",
    "jokeType": "Holiday"
  },
  {
    "id": 5,
    "jokeText": "Why did the math book look sad? Because it had too many problems.",
    "jokeType": "Education"
  },
  {
    "id": 6,
    "jokeText": "Why don’t skeletons fight each other? They don’t have the guts.",
    "jokeType": "Halloween"
  },
  {
    "id": 7,
    "jokeText": "Why was the computer cold? It left its Windows open.",
    "jokeType": "Technology"
  },
  {
    "id": 8,
    "jokeText": "Why did the bicycle fall over? Because it was two-tired!",
    "jokeType": "Transportation"
  },
  {
    "id": 9,
    "jokeText": "What do you call cheese that isn't yours? Nacho cheese.",
    "jokeType": "Food"
  },
  {
    "id": 10,
    "jokeText": "What’s orange and sounds like a parrot? A carrot!",
    "jokeType": "Animals"
  },
  {
    "id": 11,
    "jokeText": "How does a penguin build its house? Igloos it together.",
    "jokeType": "Animals"
  },
  {
    "id": 12,
    "jokeText": "What do you call an alligator in a vest? An investigator.",
    "jokeType": "Animals"
  },
  {
    "id": 13,
    "jokeText": "Why don't some couples go to the gym? Because some relationships don't work out.",
    "jokeType": "Relationship"
  },
  {
    "id": 14,
    "jokeText": "What did one wall say to the other wall? I'll meet you at the corner.",
    "jokeType": "Construction"
  },
  {
    "id": 15,
    "jokeText": "Why did the golfer bring two pairs of pants? In case he got a hole in one.",
    "jokeType": "Sports"
  },
  {
    "id": 16,
    "jokeText": "Why did the tomato turn red? Because it saw the salad dressing.",
    "jokeType": "Food"
  },
  {
    "id": 17,
    "jokeText": "What do you call a dinosaur with an extensive vocabulary? A thesaurus.",
    "jokeType": "Animals"
  },
  {
    "id": 18,
    "jokeText": "What’s a skeleton’s least favorite room in the house? The living room.",
    "jokeType": "Halloween"
  },
  {
    "id": 19,
    "jokeText": "Why don’t programmers like nature? It has too many bugs.",
    "jokeType": "Technology"
  },
  {
    "id": 20,
    "jokeText": "What’s brown and sticky? A stick.",
    "jokeType": "Nature"
  },
  {
    "id": 21,
    "jokeText": "Why did the coffee file a police report? It got mugged.",
    "jokeType": "Food"
  },
  {
    "id": 22,
    "jokeText": "What kind of shoes do ninjas wear? Sneakers.",
    "jokeType": "Clothing"
  },
  {
    "id": 23,
    "jokeText": "Why did the scarecrow become a successful neurosurgeon? Because he was outstanding in his field!",
    "jokeType": "Occupation"
  },
  {
    "id": 24,
    "jokeText": "How does a scientist freshen her breath? With experi-mints.",
    "jokeType": "Science"
  },
  {
    "id": 25,
    "jokeText": "Why are ghosts bad at lying? Because they are too transparent.",
    "jokeType": "Halloween"
  },
  {
    "id": 26,
    "jokeText": "What do you get when you cross a dog with a calculator? A friend you can count on.",
    "jokeType": "Animals"
  },
  {
    "id": 27,
    "jokeText": "Why did the chicken join a band? Because it had the drumsticks.",
    "jokeType": "Music"
  },
  {
    "id": 28,
    "jokeText": "What did the grape do when he got stepped on? Nothing but let out a little wine.",
    "jokeType": "Food"
  },
  {
    "id": 29,
    "jokeText": "What do you call a bear with no teeth? A gummy bear.",
    "jokeType": "Animals"
  },
  {
    "id": 30,
    "jokeText": "Why did the physics professor break up with the biology professor? There was no chemistry.",
    "jokeType": "Education"
  },
  {
    "id": 31,
    "jokeText": "What do you call a factory that makes good products? A satisfactory.",
    "jokeType": "Occupation"
  },
  {
    "id": 32,
    "jokeText": "Why don’t elephants use computers? They are afraid of the mouse.",
    "jokeType": "Technology"
  },
  {
    "id": 33,
    "jokeText": "What kind of tree fits in your hand? A palm tree.",
    "jokeType": "Nature"
  },
  {
    "id": 34,
    "jokeText": "Why was the math teacher suspicious of prime numbers? Because they couldn't be divided.",
    "jokeType": "Education"
  },
  {
    "id": 35,
    "jokeText": "Why did the stadium get hot after the game? All of the fans left.",
    "jokeType": "Sports"
  },
  {
    "id": 36,
    "jokeText": "How do you catch a whole school of fish? With bookworms.",
    "jokeType": "Animals"
  },
  {
    "id": 37,
    "jokeText": "Why did the invisible man turn down the job offer? He couldn't see himself doing it.",
    "jokeType": "Occupation"
  },
  {
    "id": 38,
    "jokeText": "Why did the musician break up with his metronome? It couldn't keep up with the tempo.",
    "jokeType": "Music"
  },
  {
    "id": 39,
    "jokeText": "Why was the broom late? It swept in.",
    "jokeType": "Household"
  },
  {
    "id": 40,
    "jokeText": "What do you call a lazy kangaroo? A pouch potato.",
    "jokeType": "Animals"
  },
  {
    "id": 41,
    "jokeText": "Why did the astronaut break up with his girlfriend? He needed space.",
    "jokeType": "Relationship"
  },
  {
    "id": 42,
    "jokeText": "Why don’t skeletons ever use cell phones? They can’t find their bones.",
    "jokeType": "Halloween"
  },
  {
    "id": 43,
    "jokeText": "What do you call a funny mountain? Hill-arious.",
    "jokeType": "Nature"
  },
  {
    "id": 44,
    "jokeText": "Why did the actor break a leg? Because every play has a cast.",
    "jokeType": "Occupation"
  },
  {
    "id": 45,
    "jokeText": "Why don't seagulls fly over the bay? Because then they'd be bagels.",
    "jokeType": "Animals"
  },
  {
    "id": 46,
    "jokeText": "Why do cows wear bells? Because their horns don’t work.",
    "jokeType": "Animals"
  },
  {
    "id": 47,
    "jokeText": "How do you organize a space party? You planet.",
    "jokeType": "Science"
  },
  {
    "id": 48,
    "jokeText": "What do you call a pile of cats? A meow-tain.",
    "jokeType": "Animals"
  },
  {
    "id": 49,
    "jokeText": "Why did the picture go to jail? Because it was framed.",
    "jokeType": "Crime"
  },
  {
    "id": 50,
    "jokeText": "Why did the scarecrow get promoted? Because he was outstanding in his field.",
    "jokeType": "Occupation"
  },
  {
    "id": 51,
    "jokeText": "What do you call a cow with no legs? Ground beef.",
    "jokeType": "Food"
  },
  {
    "id": 52,
    "jokeText": "Why don't you ever see elephants hiding in trees? Because they're so good at it.",
    "jokeType": "Animals"
  },
  {
    "id": 53,
    "jokeText": "How do you make holy water? You boil the hell out of it.",
    "jokeType": "Religion"
  },
  {
    "id": 54,
    "jokeText": "Why was the big cat disqualified from the race? Because it was a cheetah.",
    "jokeType": "Animals"
  },
  {
    "id": 55,
    "jokeText": "Why are frogs so happy? Because they eat whatever bugs them.",
    "jokeType": "Animals"
  },
  {
    "id": 56,
    "jokeText": "What do you call an elephant that doesn’t matter? An irrelephant.",
    "jokeType": "Animals"
  },
  {
    "id": 57,
    "jokeText": "Why don’t oysters share their pearls? Because they are shellfish.",
    "jokeType": "Food"
  },
  {
    "id": 58,
    "jokeText": "What’s a cow’s favorite type of math? Moo-nometry.",
    "jokeType": "Education"
  },
  {
    "id": 59,
    "jokeText": "Why did the teddy bear say no to dessert? Because it was already stuffed.",
    "jokeType": "Food"
  }
]
